{
  "format": "layers-model",
  "generatedBy": "keras v2.6.0",
  "convertedBy": "TensorFlow.js Converter v3.9.0",
  "modelTopology": {
    "keras_version": "2.6.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "movie_id"
            },
            "name": "movie_id",
            "inbound_nodes": []
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "user_id"
            },
            "name": "user_id",
            "inbound_nodes": []
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_3",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, null],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "embedding_3_input"
                  }
                },
                {
                  "class_name": "Embedding",
                  "config": {
                    "name": "embedding_3",
                    "trainable": true,
                    "batch_input_shape": [null, null],
                    "dtype": "float32",
                    "input_dim": 1683,
                    "output_dim": 128,
                    "embeddings_initializer": {
                      "class_name": "RandomUniform",
                      "config": {
                        "minval": -0.05,
                        "maxval": 0.05,
                        "seed": null
                      }
                    },
                    "embeddings_regularizer": null,
                    "activity_regularizer": null,
                    "embeddings_constraint": null,
                    "mask_zero": false,
                    "input_length": null
                  }
                }
              ]
            },
            "name": "sequential_3",
            "inbound_nodes": [[["movie_id", 0, 0, {}]]]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_2",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, null],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "embedding_2_input"
                  }
                },
                {
                  "class_name": "Embedding",
                  "config": {
                    "name": "embedding_2",
                    "trainable": true,
                    "batch_input_shape": [null, null],
                    "dtype": "float32",
                    "input_dim": 944,
                    "output_dim": 128,
                    "embeddings_initializer": {
                      "class_name": "RandomUniform",
                      "config": {
                        "minval": -0.05,
                        "maxval": 0.05,
                        "seed": null
                      }
                    },
                    "embeddings_regularizer": null,
                    "activity_regularizer": null,
                    "embeddings_constraint": null,
                    "mask_zero": false,
                    "input_length": null
                  }
                }
              ]
            },
            "name": "sequential_2",
            "inbound_nodes": [[["user_id", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "name": "concatenate",
            "inbound_nodes": [
              [
                ["sequential_3", 1, 0, {}],
                ["sequential_2", 1, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential_4",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 256],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "dense_input"
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense",
                    "trainable": true,
                    "batch_input_shape": [null, 256],
                    "dtype": "float32",
                    "units": 1024,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 512,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 512,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 128,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "dense_4",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  }
                }
              ]
            },
            "name": "sequential_4",
            "inbound_nodes": [[["concatenate", 0, 0, {}]]]
          }
        ],
        "input_layers": [
          ["movie_id", 0, 0],
          ["user_id", 0, 0]
        ],
        "output_layers": [["sequential_4", 1, 0]]
      }
    },
    "training_config": {
      "loss": {
        "class_name": "MeanSquaredError",
        "config": { "reduction": "auto", "name": "mean_squared_error" }
      },
      "metrics": null,
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adagrad",
        "config": {
          "name": "Adagrad",
          "learning_rate": 0.015553731471300125,
          "decay": 0.0,
          "initial_accumulator_value": 0.1,
          "epsilon": 1e-7
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"],
      "weights": [
        {
          "name": "embedding_2/embeddings",
          "shape": [944, 128],
          "dtype": "float32"
        },
        {
          "name": "embedding_3/embeddings",
          "shape": [1683, 128],
          "dtype": "float32"
        },
        { "name": "dense/kernel", "shape": [256, 1024], "dtype": "float32" },
        { "name": "dense/bias", "shape": [1024], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [1024, 512], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [512], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [512, 512], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [512], "dtype": "float32" },
        { "name": "dense_3/kernel", "shape": [512, 128], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense_4/kernel", "shape": [128, 1], "dtype": "float32" },
        { "name": "dense_4/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}

